In [1]:
import pandas as pd

In [2]:
excel_name = "Superstore.xls"

In [3]:
orders_df = pd.read_excel(excel_name, sheet_name="Orders")
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Row ID          9994 non-null   int64
 1   Order ID        9994 non-null   object
 2   Order Date      9994 non-null   datetime64[ns]
 3   Ship Date       9994 non-null   datetime64[ns]
 4   Ship Mode       9994 non-null   object
 5   Customer ID     9994 non-null   object
 6   Customer Name   9994 non-null   object
 7   Segment         9994 non-null   object
 8   Country/Region  9994 non-null   object
 9   City            9994 non-null   object
 10  State           9994 non-null   object
 11  Postal Code     9983 non-null   float64
 12  Region          9994 non-null   object
 13  Product ID      9994 non-null   object
 14  Category        9994 non-null   object
 15  Sub-Category    9994 non-null   object
 16  Product Name    9994 non-null   object
 17  Sales           9994 non-null   float64
 18  Quantity        9994 non-null   int64
 19  Discount        9994 non-null   float64
 20  Profit          9994 non-null   float64
dtypes: datetime64[ns](2), float64(4), int64(2), object(13)
memory usage: 1.6+ MB

In [4]:
orders_df[orders_df["Product ID"] == "FUR-BO-10002213"][["Order Date", "Product Name"]].sort_values("Order Date")

     Order Date                                      Product Name
9395 2018-09-20             DMI Eclipse Executive Suite Bookcases
6535 2018-11-17             DMI Eclipse Executive Suite Bookcases
2808 2019-07-25  Sauder Forest Hills Library, Woodland Oak Finish
5918 2019-09-17             DMI Eclipse Executive Suite Bookcases
2115 2019-10-31             DMI Eclipse Executive Suite Bookcases
8712 2019-12-03  Sauder Forest Hills Library, Woodland Oak Finish
2471 2020-01-22  Sauder Forest Hills Library, Woodland Oak Finish
9649 2020-11-26             DMI Eclipse Executive Suite Bookcases
9583 2021-06-25             DMI Eclipse Executive Suite Bookcases
5079 2021-11-25  Sauder Forest Hills Library, Woodland Oak Finish

In [5]:
people_df = pd.read_excel(excel_name, sheet_name="People")
people_df.head()

    Regional Manager   Region
0    Sadie Pawthorne     West
1        Chuck Magee     East
2  Roxanne Rodriguez  Central
3        Fred Suzuki    South

In [6]:
returns_df = pd.read_excel(excel_name, sheet_name="Returns")
returns_df.head()

  Returned        Order ID
0      Yes  CA-2018-100762
1      Yes  CA-2018-100762
2      Yes  CA-2018-100762
3      Yes  CA-2018-100762
4      Yes  CA-2018-100867

In [7]:
[(n, c.isna().sum()) for n, c in orders_df.items()]

[('Row ID', np.int64(0)),
 ('Order ID', np.int64(0)),
 ('Order Date', np.int64(0)),
 ('Ship Date', np.int64(0)),
 ('Ship Mode', np.int64(0)),
 ('Customer ID', np.int64(0)),
 ('Customer Name', np.int64(0)),
 ('Segment', np.int64(0)),
 ('Country/Region', np.int64(0)),
 ('City', np.int64(0)),
 ('State', np.int64(0)),
 ('Postal Code', np.int64(11)),
 ('Region', np.int64(0)),
 ('Product ID', np.int64(0)),
 ('Category', np.int64(0)),
 ('Sub-Category', np.int64(0)),
 ('Product Name', np.int64(0)),
 ('Sales', np.int64(0)),
 ('Quantity', np.int64(0)),
 ('Discount', np.int64(0)),
 ('Profit', np.int64(0))]

There are 11 missing postal codes

In [8]:
orders_df[orders_df["Postal Code"].isna()][["City", "State", "Postal Code"]]

            City    State  Postal Code
2234  Burlington  Vermont          NaN
5274  Burlington  Vermont          NaN
8798  Burlington  Vermont          NaN
9146  Burlington  Vermont          NaN
9147  Burlington  Vermont          NaN
9148  Burlington  Vermont          NaN
9386  Burlington  Vermont          NaN
9387  Burlington  Vermont          NaN
9388  Burlington  Vermont          NaN
9389  Burlington  Vermont          NaN
9741  Burlington  Vermont          NaN

In [9]:
orders_df.loc[(orders_df["City"] == "Burlington") & (orders_df["State"] == "Vermont"), "Postal Code"]

2234   NaN
5274   NaN
8798   NaN
9146   NaN
9147   NaN
9148   NaN
9386   NaN
9387   NaN
9388   NaN
9389   NaN
9741   NaN
Name: Postal Code, dtype: float64

ALL missing values are postal codes from the same city `Burlington, Vermont`.
Assume the postal code is `05401` and fill in the value

In [10]:
orders_df.loc[(orders_df["City"] == "Burlington") & (orders_df["State"] == "Vermont"), "Postal Code"] = 5401

In [11]:
postal_code_city_counts = orders_df[["Postal Code", "City"]].groupby("Postal Code").nunique()
postal_code_city_counts.loc[(postal_code_city_counts > 1).to_numpy()]

             City
Postal Code
92024.0         2

In [12]:
orders_df[orders_df["Postal Code"] == 92024][["Postal Code", "City", "State"]].value_counts()

Postal Code  City       State
92024.0      San Diego  California    34
             Encinitas  California     5
Name: count, dtype: int64

In [13]:
orders_df[orders_df["Postal Code"] == 92124]

Empty DataFrame
Columns: [Row ID, Order ID, Order Date, Ship Date, Ship Mode, Customer ID, Customer Name, Segment, Country/Region, City, State, Postal Code, Region, Product ID, Category, Sub-Category, Product Name, Sales, Quantity, Discount, Profit]
Index: []

[0 rows x 21 columns]

In [14]:
# Postal code 92024 in city of San Diego in California could be a typo for 92124 in

orders_df.loc[(orders_df["State"] == "California") & (orders_df["City"] == "San Diego") & (orders_df["Postal Code"] == 92024), "Postal Code"] = 92124

### Inital Attributes

In [15]:
init_order_columns = set(orders_df.columns)
init_order_columns

{'Category',
 'City',
 'Country/Region',
 'Customer ID',
 'Customer Name',
 'Discount',
 'Order Date',
 'Order ID',
 'Postal Code',
 'Product ID',
 'Product Name',
 'Profit',
 'Quantity',
 'Region',
 'Row ID',
 'Sales',
 'Segment',
 'Ship Date',
 'Ship Mode',
 'State',
 'Sub-Category'}

In [16]:
init_people_columns = set(people_df.columns)
init_people_columns

{'Region', 'Regional Manager'}

In [17]:
init_return_columns = set(returns_df.columns)
init_return_columns

{'Order ID', 'Returned'}

### Remove Row ID for it serves no practical meaning

In [18]:
orders_df.drop("Row ID", axis=1, inplace=True)

In [19]:
orders_df["Ship Mode"].value_counts()

Ship Mode
Standard Class    5968
Second Class      1945
First Class       1538
Same Day           543
Name: count, dtype: int64

Four types of shipping mode: Standard, Second Class, First Class, Same Day
Assuming expense order from most to least expensive:
- Same Day
- First Class
- Second Class
- Standard

Add `Ship Mode Code` attribute

In [20]:
ship_name_modes = {"Same Day": "0", "First Class": "1", "Second Class": "2", "Standard Class": "S"}
orders_df["Ship Mode Code"] = orders_df["Ship Mode"].map(ship_name_modes)
orders_df["Ship Mode Code"].isna().sum()

np.int64(0)

In [21]:
orders_df["Segment"].value_counts()

Segment
Consumer       5191
Corporate      3020
Home Office    1783
Name: count, dtype: int64

Add `Segment Code` attribute

Three types of customer segments:
- Consumer
- Corporate
- Home Office

In [22]:
segment_name_codes = { "Consumer": "S", "Corporate": "C", "Home Office": "O" }
orders_df["Segment Code"] = orders_df["Segment"].map(segment_name_codes)
orders_df["Segment Code"].isna().sum()

np.int64(0)

In [23]:
orders_df["Country/Region"].value_counts()

Country/Region
United States    9994
Name: count, dtype: int64

All sales are made in the United States

In [24]:
orders_df["City"].value_counts()

City
New York City    915
Los Angeles      747
Philadelphia     537
San Francisco    510
Seattle          428
                ...
Abilene            1
Montebello         1
Kissimmee          1
Danbury            1
Springdale         1
Name: count, Length: 531, dtype: int64

In [25]:
orders_df["State"].value_counts()

State
California              2001
New York                1128
Texas                    985
Pennsylvania             587
Washington               506
Illinois                 492
Ohio                     469
Florida                  383
Michigan                 255
North Carolina           249
Arizona                  224
Virginia                 224
Georgia                  184
Tennessee                183
Colorado                 182
Indiana                  149
Kentucky                 139
Massachusetts            135
New Jersey               130
Oregon                   124
Wisconsin                110
Maryland                 105
Delaware                  96
Minnesota                 89
Connecticut               82
Missouri                  66
Oklahoma                  66
Alabama                   61
Arkansas                  60
Rhode Island              56
Utah                      53
Mississippi               53
South Carolina            42
Louisiana                 42
Nevada                    39
Nebraska                  38
New Mexico                37
Iowa                      30
New Hampshire             27
Kansas                    24
Idaho                     21
Montana                   15
South Dakota              12
Vermont                   11
District of Columbia      10
Maine                      8
North Dakota               7
West Virginia              4
Wyoming                    1
Name: count, dtype: int64

In [26]:
# Add state codes
state_name_codes = {
    "Alabama": "AL", "Alaska": "AK", "Arizona": "AZ", "Arkansas": "AR", "California": "CA",
    "Colorado": "CO", "Connecticut": "CT", "Delaware": "DE", "Florida": "FL", "Georgia": "GA",
    "Hawaii": "HI", "Idaho": "ID", "Illinois": "IL", "Indiana": "IN", "Iowa": "IA", 
    "Kansas": "KS", "Kentucky": "KY", "Louisiana": "LA", "Maine": "ME", "Maryland": "MD", 
    "Massachusetts": "MA", "Michigan": "MI", "Minnesota": "MN", "Mississippi": "MS", "Missouri": "MO",
    "Montana": "MT", "Nebraska": "NE", "Nevada": "NV", "New Hampshire": "NH", "New Jersey": "NJ",
    "New Mexico": "NM", "New York": "NY", "North Carolina": "NC", "North Dakota": "ND", "Ohio": "OH", 
    "Oklahoma": "OK", "Oregon": "OR", "Pennsylvania": "PA", "Rhode Island": "RI", "South Carolina": "SC", 
    "South Dakota": "SD", "Tennessee": "TN", "Texas": "TX", "Utah": "UT", "Vermont": "VT", 
    "Virginia": "VA", "Washington": "WA", "West Virginia": "WV", "Wisconsin": "WI", "Wyoming": "WY",
    "District of Columbia": "DC", "Guam": "GU", "Marshall Islands": "MH", "Northern Mariana Island": "MP", "Puerto Rico": "PR", "Virgin Islands": "VI"
}
orders_df["State Code"] = orders_df["State"].map(state_name_codes)
orders_df[orders_df["State Code"].isna()][["State", "State Code"]]

Empty DataFrame
Columns: [State, State Code]
Index: []

In [27]:
orders_df["Region"].value_counts()

Region
West       3203
East       2848
Central    2323
South      1620
Name: count, dtype: int64

Add `Region Code` attribute

In [28]:
region_name_codes = { "West": "W", "East": "E", "Central": "C", "South": "S" }
orders_df["Region Code"] = orders_df["Region"].map(region_name_codes)
orders_df["Region Code"].isna().sum()

np.int64(0)

In [29]:
orders_df["Product ID"].value_counts()

Product ID
OFF-PA-10001970    19
TEC-AC-10003832    18
FUR-FU-10004270    16
FUR-CH-10002647    15
FUR-CH-10001146    15
                   ..
TEC-MA-10004552     1
TEC-MA-10003589     1
OFF-AP-10003099     1
TEC-PH-10002645     1
OFF-ST-10001627     1
Name: count, Length: 1862, dtype: int64

In [30]:
orders_df["Category"].value_counts()

Category
Office Supplies    6026
Furniture          2121
Technology         1847
Name: count, dtype: int64

Three product categories:
- Office Supplies
- Furniture
- Technology

In [31]:
orders_df["Sub-Category"].value_counts()

Sub-Category
Binders        1523
Paper          1370
Furnishings     957
Phones          889
Storage         846
Art             796
Accessories     775
Chairs          617
Appliances      466
Labels          364
Tables          319
Envelopes       254
Bookcases       228
Fasteners       217
Supplies        190
Machines        115
Copiers          68
Name: count, dtype: int64

In [32]:
orders_df[["Category", "Sub-Category", "Product ID"]].head()

          Category Sub-Category       Product ID
0        Furniture    Bookcases  FUR-BO-10001798
1        Furniture       Chairs  FUR-CH-10000454
2  Office Supplies       Labels  OFF-LA-10000240
3        Furniture       Tables  FUR-TA-10000577
4  Office Supplies      Storage  OFF-ST-10000760

Product ID starts with category and subcategory code

Add `Category Code` attribute

In [33]:
orders_df["Category Code"] = orders_df["Product ID"].map(lambda p: p.split("-")[0])
orders_df["Category Code"].value_counts()

Category Code
OFF    6026
FUR    2121
TEC    1847
Name: count, dtype: int64

Add `Sub-Category Code` attribute

In [34]:
orders_df["Sub-Category Code"] = orders_df["Product ID"].map(lambda p: p.split("-")[1])
orders_df["Sub-Category Code"].value_counts()

Sub-Category Code
BI    1523
PA    1370
FU     957
PH     889
ST     846
AR     796
AC     775
CH     617
AP     466
LA     364
TA     319
EN     254
BO     228
FA     217
SU     190
MA     115
CO      68
Name: count, dtype: int64

Add `Employee ID` attribute

In [35]:
employee_ids = { 
    "Sadie Pawthorne": "SP-00001",
    "Chuck Magee": "CM-00002",
    "Roxanne Rodriguez": "RR-00003",
    "Fred Suzuki": "FS-00004"
}
people_df["Employee ID"] = people_df["Regional Manager"].map(employee_ids)

In [36]:
orders_df["Discount"].value_counts()

Discount
0.00    4798
0.20    3657
0.70     418
0.80     300
0.30     227
0.40     206
0.60     138
0.10      94
0.50      66
0.15      52
0.32      27
0.45      11
Name: count, dtype: int64

In [37]:
orders_df[["Sales", "Quantity", "Discount", "Profit"]].describe()

              Sales     Quantity     Discount       Profit
count   9994.000000  9994.000000  9994.000000  9994.000000
mean     229.858001     3.789574     0.156203    28.656896
std      623.245101     2.225110     0.206452   234.260108
min        0.444000     1.000000     0.000000 -6599.978000
25%       17.280000     2.000000     0.000000     1.728750
50%       54.490000     3.000000     0.200000     8.666500
75%      209.940000     5.000000     0.200000    29.364000
max    22638.480000    14.000000     0.800000  8399.976000

* Deepest discount is 0.8
* There are negative profits

In [38]:
returns_df["Returned"].value_counts()

Returned
Yes    800
Name: count, dtype: int64

The `Returned` column serves no purpose for it consists of only `Yes` values

In [39]:
returns_df.drop("Returned", axis=1, inplace=True)

In [40]:
orders_df.duplicated().sum()

np.int64(1)

Not any order is a duplication

### Is all items returned when an order is returned

In [41]:
order_items_counts = orders_df["Order ID"].value_counts()
return_items_counts = returns_df["Order ID"].value_counts()
returned_order_items_counts = pd.DataFrame({ "Order Item Count": order_items_counts,  "Return Item Count": return_items_counts }).dropna()
returned_order_items_counts[returned_order_items_counts["Order Item Count"] != returned_order_items_counts["Return Item Count"]]

Empty DataFrame
Columns: [Order Item Count, Return Item Count]
Index: []

For each returned order, all items in the order are returned.

### Calculating Unit Prices

In [42]:
sales = orders_df["Sales"]
quantities = orders_df["Quantity"]
discounts = orders_df["Discount"]
sales_before_discounts = sales / (1 - orders_df["Discount"])
unit_prices = (sales_before_discounts / quantities).round(2)
orders_df["Unit Price"] = unit_prices

In [43]:
product_ids = orders_df["Product ID"]
product_prices = pd.DataFrame({"Product ID": orders_df["Product ID"], "Unit Price": unit_prices}).groupby(["Product ID", "Unit Price"]).value_counts()
product_prices

Product ID       Unit Price
FUR-BO-10000112  130.98        1
FUR-BO-10000330  120.98        3
FUR-BO-10000362  170.98        5
FUR-BO-10000468  48.58         6
FUR-BO-10000711  70.98         2
                              ..
TEC-PH-10004912  54.95         3
TEC-PH-10004922  66.99         5
TEC-PH-10004924  7.39          3
TEC-PH-10004959  100.49        2
TEC-PH-10004977  195.99        9
Name: count, Length: 1894, dtype: int64

In [44]:
# By setting the index to only `Product ID`, any product with more than one unit price will cause error.
# This way making sure each product has only one unit price.
# Note.  If one product has more than one unit price does not mean it's invalid.  It's just indicate the price has changed before
product_prices.reset_index(1)

                 Unit Price  count
Product ID
FUR-BO-10000112      130.98      1
FUR-BO-10000330      120.98      3
FUR-BO-10000362      170.98      5
FUR-BO-10000468       48.58      6
FUR-BO-10000711       70.98      2
...                     ...    ...
TEC-PH-10004912       54.95      3
TEC-PH-10004922       66.99      5
TEC-PH-10004924        7.39      3
TEC-PH-10004959      100.49      2
TEC-PH-10004977      195.99      9

[1894 rows x 2 columns]

There is one unit price per product

In [45]:
# Find each product's unit cost
profits = orders_df["Profit"]
unit_costs = ((sales.round(2) - profits.round(2)) / quantities).round(2)
orders_df["Unit Cost"] = unit_costs
product_costs = orders_df[["Product ID", "Unit Cost"]]
product_costs
orders_df[orders_df["Product ID"] == "OFF-BI-10003684"][["Sales", "Quantity", "Discount", "Profit", "Unit Cost"]]

        Sales  Quantity  Discount  Profit  Unit Cost
908    52.776         3       0.2  19.791      11.00
1334  140.736         8       0.2  52.776      11.00
4728  123.144         7       0.2  46.179      10.99
5061   43.980         2       0.0  21.990      11.00
7736   70.368         4       0.2  26.388      11.00
7942   39.582         9       0.8 -59.373      10.99
8352   26.388         4       0.7 -17.592      11.00
8874   21.990         5       0.8 -32.985      10.99
9711   13.194         2       0.7  -8.796      11.00

In [46]:
cost_var = orders_df[["Product ID", "Product Name", "Unit Cost"]].groupby(["Product ID", "Product Name"]).var().dropna()
cost_var[cost_var > 0].dropna().describe()

        Unit Cost
count  540.000000
mean     0.000025
std      0.000009
min      0.000007
25%      0.000017
50%      0.000025
75%      0.000030
max      0.000050

In [47]:
orders_df[["Order ID", "Sales"]].groupby("Order ID").nunique()

                Sales
Order ID
CA-2018-100006      1
CA-2018-100090      2
CA-2018-100293      1
CA-2018-100328      1
CA-2018-100363      2
...               ...
US-2021-168802      1
US-2021-169320      2
US-2021-169488      2
US-2021-169502      2
US-2021-169551      6

[5009 rows x 1 columns]

In [101]:
# Ensure the count with the same Order ID from the Return sheet is the same count from the Orders sheet
# If they are the same, it means all items in eac are returned
order_items_count = orders_df.groupby("Order ID").size()
return_items_count = returns_df.value_counts().reset_index().set_index("Order ID")
order_return_items_count = pd.concat([order_items_count, return_items_count], axis=1).dropna()
(order_return_items_count.iloc[:,0] == order_return_items_count.iloc[:,1]).all()

np.True_

### New or removed columns

In [48]:
# Columns added to orders
set(orders_df.columns) - init_order_columns

{'Category Code',
 'Region Code',
 'Segment Code',
 'Ship Mode Code',
 'State Code',
 'Sub-Category Code',
 'Unit Cost',
 'Unit Price'}

In [49]:
# Columns removed from orders
init_order_columns - set(orders_df.columns)

{'Row ID'}

In [50]:
# Columns added to people
set(people_df.columns) - init_people_columns

{'Employee ID'}

In [51]:
# Columns removed from people
init_people_columns - set(people_df.columns)

set()

In [52]:
# Columns added to Returns
set(returns_df.columns) - init_return_columns

set()

In [53]:
# Columns remomved from Returned
init_return_columns - set(returns_df.columns)

{'Returned'}

### Exporting CSVs

In [54]:
import os
if not os.path.isdir("data"):
    os.makedirs("data")

In [55]:
# Export data/categories.csv
category_index = orders_df[["Category Code", "Category"]].value_counts().index
category_index.to_frame(index=False).set_index(["Category Code"]).to_csv("data/categories.csv", index_label="category_code", header=["cateogry_name"])

In [56]:
# Export data/subcategories.csv
subcategory_index = orders_df[["Category Code", "Sub-Category Code", "Sub-Category"]].value_counts().index
subcategory_index.to_frame(index=False).set_index(["Category Code", "Sub-Category Code"]).to_csv("data/subcategories.csv", index_label=["category_code", "subcategory_code"], header=["subcategory_name"])

In [57]:
# Export data/employees.csv
people_df[["Employee ID", "Regional Manager"]].set_index("Employee ID").to_csv("data/employees.csv", index_label=["employee_id"], header=["employee_name"])

In [58]:
# Export data/ship_modes.csv
orders_df[["Ship Mode", "Ship Mode Code"]].value_counts().index.to_frame().set_index("Ship Mode Code").to_csv("data/ship_modes.csv", index_label=["ship_mode_code"], header=["ship_mode_name"])

In [59]:
# Export data/customer_segments.csv
orders_df[["Segment Code", "Segment"]].value_counts().index.to_frame().set_index("Segment Code").to_csv("data/customer_segments.csv", index_label=["segment_code"], header=["segment_name"])

In [60]:
# Export data/customers.csv
orders_df[["Customer ID", "Segment Code", "Customer Name"]].value_counts().index.to_frame().set_index("Customer ID").to_csv("data/customers.csv", index_label=["customer_id"], header=["segment_code", "customer_name"])

In [61]:
# Export data/regions.csv
people_df["Region Code"] = people_df["Region"].map(region_name_codes)
people_df[["Region Code", "Region", "Employee ID"]].set_index("Region Code").to_csv("data/regions.csv", index_label=["region_code"], header=["region_name", "manager_employee_id"])

In [62]:
# Export data/states.csv
orders_df[["State Code", "Region Code", "State"]].value_counts().index.to_frame().set_index("State Code").to_csv("data/states.csv", index_label=["state_code"], header=["region_code", "state_name"])

In [63]:
# Export data/cities.csv
cities = orders_df[["State Code", "City"]].value_counts().index.to_frame().sort_index().reset_index(drop=True)
cities.index += 1
cities.index.to_frame()

       0
1      1
2      2
3      3
4      4
5      5
..   ...
600  600
601  601
602  602
603  603
604  604

[604 rows x 1 columns]

In [64]:
cities.to_csv("data/cities.csv", index_label="city_id", header=["state_code", "city_name"])

In [65]:
cities["City ID"] = cities.index.to_frame()
cities

    State Code        City  City ID
1           AL      Auburn        1
2           AL     Decatur        2
3           AL    Florence        3
4           AL      Hoover        4
5           AL  Huntsville        5
..         ...         ...      ...
600         WI    Waukesha      600
601         WI      Wausau      601
602         WI  West Allis      602
603         WV    Wheeling      603
604         WY    Cheyenne      604

[604 rows x 3 columns]

In [66]:
orders_df["City ID"] = orders_df.merge(cities, on=["State Code", "City"])["City ID"]

In [67]:
# Export data/stores.csv

In [68]:
orders_df[["Postal Code", "City ID"]].value_counts().index.to_frame().set_index("Postal Code").to_csv("data/stores.csv", index_label="postal_code", header=["city_id"])

In [69]:
orders_df[orders_df["Product ID"] == "FUR-BO-10000112"]

,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country/Region,City,State,...,Profit,Ship Mode Code,Segment Code,State Code,Region Code,Category Code,Sub-Category Code,Unit Price,Unit Cost,City ID
3512,CA-2021-140326,2021-09-04,2021-09-06,First Class,HW-14935,Helen Wasserman,Corporate,United States,Chicago,Illinois,...,-117.882,1,C,IL,C,FUR,BO,130.98,104.78,210

In [70]:
normalized_unit_prices = orders_df[["Product ID", "Product Name", "Unit Price"]].groupby(["Product ID", "Product Name"]).mean().round(2)
normalized_unit_costs = orders_df[["Product ID", "Product Name", "Unit Cost"]].groupby(["Product ID", "Product Name"]).mean().round(2)
normalized_unit_costs

                                                                    Unit Cost
Product ID      Product Name
FUR-BO-10000112 Bush Birmingham Collection Bookcase, Dark Cherry       104.78
FUR-BO-10000330 Sauder Camden County Barrister Bookcase, Planke...     104.04
FUR-BO-10000362 Sauder Inglewood Library Bookcases                     131.66
FUR-BO-10000468 O'Sullivan 2-Shelf Heavy-Duty Bookcases                 40.81
FUR-BO-10000711 Hon Metal Bookcases, Gray                               51.82
...                                                                       ...
TEC-PH-10004912 Cisco SPA112 2 Port Phone Adapter                       39.01
TEC-PH-10004922 RCA Visys Integrated PBX 8-Line Router                  50.24
TEC-PH-10004924 SKILCRAFT Telephone Shoulder Rest, 2" x 6.5" x ...       5.40
TEC-PH-10004959 Classic Ivory AntiqueÂ TelephoneÂ ZL1810                  75.37
TEC-PH-10004977 GE 30524EE4                                            139.15

[1894 rows x 1 columns]

In [71]:
# Export data/products.csv

products = orders_df[["Product ID", "Category Code", "Sub-Category Code", "Product Name"]].value_counts().index.to_frame().set_index(["Product ID", "Product Name"], verify_integrity=True)
products["Unit Price"] = normalized_unit_prices
products["Unit Cost"] = normalized_unit_costs
products.to_csv("data/products.csv", index_label=["product_id", "product_name"], header=["category_code", "subcategory_code", "unit_price", "unit_cost"])

In [72]:
# Export data/orders.csv
orders = orders_df[["Order ID", "Customer ID", "Postal Code", "Order Date", "Ship Mode Code", "Ship Date"]].value_counts().index.to_frame().reset_index(drop=True).set_index("Order ID", verify_integrity=True)
orders.to_csv("data/orders.csv", index_label="order_id", header=["customer_id", "postal_code", "order_date", "ship_mode_code", "shipping_date"])

In [75]:
# Export data/order_items.csv
order_items = orders_df[["Order ID", "Product ID", "Product Name", "Unit Price", "Unit Cost", "Quantity", "Discount", "Sales"]]
order_items.index += 1
order_items.to_csv("data/order_items.csv", index_label="order_item_id", header=["order_id", "product_id", "product_name", "unit_price", "unit_cost", "quantity", "discount_percentage", "amount"])

In [100]:
order_items_count = orders_df.groupby("Order ID").size()
return_items_count = returns_df.value_counts().reset_index().set_index("Order ID")
order_return_items_count = pd.concat([order_items_count, return_items_count], axis=1).dropna()
(order_return_items_count.iloc[:,0] == order_return_items_count.iloc[:,1]).all()

np.True_

In [74]:
# Export data/order_returns.csv
returns_df.to_csv("data/order_returns.csv", index=False, header=["order_id"])